MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12B0AGP2B000/mcu.h
            };
          };
          union {
            __IO uint16_t PZRAH;
            struct {
              __IO uint8_t PZRAHL;
              __IO uint8_t PZRAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRB;
        struct {
          union {
            __IO uint16_t PZRBL;
            struct {
              __IO uint8_t PZRBLL;
              __IO uint8_t PZRBLH;
            };
          };
          union {
            __IO uint16_t PZRBH;
            struct {
              __IO uint8_t PZRBHL;
              __IO uint8_t PZRBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRC;
        struct {
          union {
            __IO uint16_t PZRCL;
            struct {
              __IO uint8_t PZRCLL;
              __IO uint8_t PZRCLH;
            };
          };
          union {
            __IO uint16_t PZRCH;
            struct {
              __IO uint8_t PZRCHL;
              __IO uint8_t PZRCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRD;
        struct {
          union {
            __IO uint16_t PZRDL;
            struct {
              __IO uint8_t PZRDLL;
              __IO uint8_t PZRDLH;
            };
          };
          union {
            __IO uint16_t PZRDH;
            struct {
              __IO uint8_t PZRDHL;
              __IO uint8_t PZRDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRE;
        stc_gpio_pzre_field_t PZRE_f;
        struct {
          union {
            __IO uint16_t PZREL;
            struct {
              __IO uint8_t PZRELL;
              __IO uint8_t PZRELH;
            };
          };
          union {
            __IO uint16_t PZREH;
            struct {
              __IO uint8_t PZREHL;
              __IO uint8_t PZREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRF;
        struct {
          union {
            __IO uint16_t PZRFL;
            struct {
              __IO uint8_t PZRFLL;
              __IO uint8_t PZRFLH;
            };
          };
          union {
            __IO uint16_t PZRFH;
            struct {
              __IO uint8_t PZRFHL;
              __IO uint8_t PZRFHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED13[448];
    union {
        __IO uint32_t FPOER0;
        stc_gpio_fpoer0_field_t FPOER0_f;
        struct {
          union {
            __IO uint16_t FPOER0L;
            struct {
              __IO uint8_t FPOER0LL;
              __IO uint8_t FPOER0LH;
            };
          };
          union {
            __IO uint16_t FPOER0H;
            struct {
              __IO uint8_t FPOER0HL;
              __IO uint8_t FPOER0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER1;
        stc_gpio_fpoer1_field_t FPOER1_f;
        struct {
          union {
            __IO uint16_t FPOER1L;
            struct {
              __IO uint8_t FPOER1LL;
              __IO uint8_t FPOER1LH;
            };
          };
          union {
            __IO uint16_t FPOER1H;
            struct {
              __IO uint8_t FPOER1HL;
              __IO uint8_t FPOER1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER2;
        stc_gpio_fpoer2_field_t FPOER2_f;
        struct {
          union {
            __IO uint16_t FPOER2L;
            struct {
              __IO uint8_t FPOER2LL;
              __IO uint8_t FPOER2LH;
            };
          };
          union {
            __IO uint16_t FPOER2H;
            struct {
              __IO uint8_t FPOER2HL;
              __IO uint8_t FPOER2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER3;
        stc_gpio_fpoer3_field_t FPOER3_f;
        struct {
          union {
            __IO uint16_t FPOER3L;
            struct {
              __IO uint8_t FPOER3LL;
              __IO uint8_t FPOER3LH;
            };
          };
          union {
            __IO uint16_t FPOER3H;
            struct {
              __IO uint8_t FPOER3HL;
              __IO uint8_t FPOER3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER4;
        stc_gpio_fpoer4_field_t FPOER4_f;
        struct {
          union {
            __IO uint16_t FPOER4L;
            struct {
              __IO uint8_t FPOER4LL;
              __IO uint8_t FPOER4LH;
            };
          };
          union {
            __IO uint16_t FPOER4H;
            struct {
              __IO uint8_t FPOER4HL;
              __IO uint8_t FPOER4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER5;
        struct {
          union {
            __IO uint16_t FPOER5L;
            struct {
              __IO uint8_t FPOER5LL;
              __IO uint8_t FPOER5LH;
            };
          };
          union {
            __IO uint16_t FPOER5H;
            struct {
              __IO uint8_t FPOER5HL;
              __IO uint8_t FPOER5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER6;
        stc_gpio_fpoer6_field_t FPOER6_f;
        struct {
          union {
            __IO uint16_t FPOER6L;
            struct {
              __IO uint8_t FPOER6LL;
              __IO uint8_t FPOER6LH;
            };
          };
          union {
            __IO uint16_t FPOER6H;
            struct {
              __IO uint8_t FPOER6HL;
              __IO uint8_t FPOER6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER7;
        struct {
          union {
            __IO uint16_t FPOER7L;
            struct {
              __IO uint8_t FPOER7LL;
              __IO uint8_t FPOER7LH;
            };
          };
          union {
            __IO uint16_t FPOER7H;
            struct {
              __IO uint8_t FPOER7HL;
              __IO uint8_t FPOER7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER8;
        struct {
          union {
            __IO uint16_t FPOER8L;
            struct {
              __IO uint8_t FPOER8LL;
              __IO uint8_t FPOER8LH;
            };
          };
          union {
            __IO uint16_t FPOER8H;
            struct {
              __IO uint8_t FPOER8HL;
              __IO uint8_t FPOER8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER9;
        struct {
          union {
            __IO uint16_t FPOER9L;
            struct {
              __IO uint8_t FPOER9LL;
              __IO uint8_t FPOER9LH;
            };
          };
          union {
            __IO uint16_t FPOER9H;
            struct {
              __IO uint8_t FPOER9HL;
              __IO uint8_t FPOER9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERA;
        struct {
          union {
            __IO uint16_t FPOERAL;
            struct {
              __IO uint8_t FPOERALL;
              __IO uint8_t FPOERALH;
            };
          };
          union {
            __IO uint16_t FPOERAH;
            struct {
              __IO uint8_t FPOERAHL;
              __IO uint8_t FPOERAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERB;
        struct {
          union {
            __IO uint16_t FPOERBL;
            struct {
              __IO uint8_t FPOERBLL;
              __IO uint8_t FPOERBLH;
            };
          };
          union {
            __IO uint16_t FPOERBH;
            struct {
              __IO uint8_t FPOERBHL;
              __IO uint8_t FPOERBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERC;
        struct {
          union {
            __IO uint16_t FPOERCL;
            struct {
              __IO uint8_t FPOERCLL;
              __IO uint8_t FPOERCLH;
            };
          };
          union {
            __IO uint16_t FPOERCH;
            struct {
              __IO uint8_t FPOERCHL;
              __IO uint8_t FPOERCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERD;
        struct {
          union {
            __IO uint16_t FPOERDL;
            struct {
              __IO uint8_t FPOERDLL;
              __IO uint8_t FPOERDLH;
            };
          };
          union {
            __IO uint16_t FPOERDH;
            struct {
              __IO uint8_t FPOERDHL;
              __IO uint8_t FPOERDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERE;
        stc_gpio_fpoere_field_t FPOERE_f;
        struct {
          union {
            __IO uint16_t FPOEREL;
            struct {
              __IO uint8_t FPOERELL;
              __IO uint8_t FPOERELH;
            };
          };
          union {
            __IO uint16_t FPOEREH;
            struct {
              __IO uint8_t FPOEREHL;
              __IO uint8_t FPOEREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERF;
        struct {
          union {
            __IO uint16_t FPOERFL;
            struct {
              __IO uint8_t FPOERFLL;
              __IO uint8_t FPOERFLH;
            };
          };
          union {
            __IO uint16_t FPOERFH;
            struct {
              __IO uint8_t FPOERFHL;
              __IO uint8_t FPOERFHH;
            };
          };
        };
    };
} FM_GPIO_TypeDef, FM0P_GPIO_TypeDef;

