MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1A12B0AGP2B000/mcu.h
#define FM_MFS_I2C_TDR_AVAILABLE                  1
#define FM0P_MFS_LIN_BGR_AVAILABLE                1
#define FM_MFS_LIN_BGR_AVAILABLE                  1
#define FM0P_MFS_LIN_ESCR_AVAILABLE               1
#define FM_MFS_LIN_ESCR_AVAILABLE                 1
#define FM0P_MFS_LIN_FBYTE1_AVAILABLE             1
#define FM_MFS_LIN_FBYTE1_AVAILABLE               1
#define FM0P_MFS_LIN_FBYTE2_AVAILABLE             1
#define FM_MFS_LIN_FBYTE2_AVAILABLE               1
#define FM0P_MFS_LIN_FCR_AVAILABLE                1
#define FM_MFS_LIN_FCR_AVAILABLE                  1
#define FM0P_MFS_LIN_RDR_AVAILABLE                1
#define FM_MFS_LIN_RDR_AVAILABLE                  1
#define FM0P_MFS_LIN_SCR_AVAILABLE                1
#define FM_MFS_LIN_SCR_AVAILABLE                  1
#define FM0P_MFS_LIN_SMR_AVAILABLE                1
#define FM_MFS_LIN_SMR_AVAILABLE                  1
#define FM0P_MFS_LIN_SSR_AVAILABLE                1
#define FM_MFS_LIN_SSR_AVAILABLE                  1
#define FM0P_MFS_LIN_TDR_AVAILABLE                1
#define FM_MFS_LIN_TDR_AVAILABLE                  1
#define FM0P_MFS_UART_BGR_AVAILABLE               1
#define FM_MFS_UART_BGR_AVAILABLE                 1
#define FM0P_MFS_UART_ESCR_AVAILABLE              1
#define FM_MFS_UART_ESCR_AVAILABLE                1
#define FM0P_MFS_UART_FBYTE1_AVAILABLE            1
#define FM_MFS_UART_FBYTE1_AVAILABLE              1
#define FM0P_MFS_UART_FBYTE2_AVAILABLE            1
#define FM_MFS_UART_FBYTE2_AVAILABLE              1
#define FM0P_MFS_UART_FCR_AVAILABLE               1
#define FM_MFS_UART_FCR_AVAILABLE                 1
#define FM0P_MFS_UART_RDR_AVAILABLE               1
#define FM_MFS_UART_RDR_AVAILABLE                 1
#define FM0P_MFS_UART_SCR_AVAILABLE               1
#define FM_MFS_UART_SCR_AVAILABLE                 1
#define FM0P_MFS_UART_SMR_AVAILABLE               1
#define FM_MFS_UART_SMR_AVAILABLE                 1
#define FM0P_MFS_UART_SSR_AVAILABLE               1
#define FM_MFS_UART_SSR_AVAILABLE                 1
#define FM0P_MFS_UART_TDR_AVAILABLE               1
#define FM_MFS_UART_TDR_AVAILABLE                 1
/*******************************************************************************
* MFT0
*******************************************************************************/
#define FM0P_MFT_ADCMP_ACFS10_AVAILABLE           1
#define FM_MFT_ADCMP_ACFS10_AVAILABLE             1
#define FM0P_MFT_ADCMP_ACFS32_AVAILABLE           1
#define FM_MFT_ADCMP_ACFS32_AVAILABLE             1
#define FM0P_MFT_ADCMP_ACFS54_AVAILABLE           1
#define FM_MFT_ADCMP_ACFS54_AVAILABLE             1
#define FM0P_MFT_ADCMP_ACMP0_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP0_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP1_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP1_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP2_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP2_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP3_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP3_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP4_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP4_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP5_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP5_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSA_AVAILABLE             1
#define FM_MFT_ADCMP_ACSA_AVAILABLE               1
#define FM0P_MFT_ADCMP_ACSC0_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC0_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC1_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC1_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC2_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC2_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC3_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC3_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC4_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC4_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC5_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC5_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD0_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD0_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD1_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD1_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD2_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD2_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD3_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD3_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD4_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD4_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD5_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD5_AVAILABLE              1
#define FM0P_MFT_FRT_TCAL_AVAILABLE               1
#define FM_MFT_FRT_TCAL_AVAILABLE                 1
#define FM0P_MFT_FRT_TCCP0_AVAILABLE              1
#define FM_MFT_FRT_TCCP0_AVAILABLE                1
#define FM0P_MFT_FRT_TCCP1_AVAILABLE              1
#define FM_MFT_FRT_TCCP1_AVAILABLE                1
#define FM0P_MFT_FRT_TCCP2_AVAILABLE              1
#define FM_MFT_FRT_TCCP2_AVAILABLE                1
#define FM0P_MFT_FRT_TCDT0_AVAILABLE              1
#define FM_MFT_FRT_TCDT0_AVAILABLE                1
#define FM0P_MFT_FRT_TCDT1_AVAILABLE              1
#define FM_MFT_FRT_TCDT1_AVAILABLE                1
#define FM0P_MFT_FRT_TCDT2_AVAILABLE              1
#define FM_MFT_FRT_TCDT2_AVAILABLE                1
#define FM0P_MFT_FRT_TCSA0_AVAILABLE              1
#define FM_MFT_FRT_TCSA0_AVAILABLE                1
#define FM0P_MFT_FRT_TCSA1_AVAILABLE              1
#define FM_MFT_FRT_TCSA1_AVAILABLE                1
#define FM0P_MFT_FRT_TCSA2_AVAILABLE              1
#define FM_MFT_FRT_TCSA2_AVAILABLE                1
#define FM0P_MFT_FRT_TCSC0_AVAILABLE              1
#define FM_MFT_FRT_TCSC0_AVAILABLE                1
#define FM0P_MFT_FRT_TCSC1_AVAILABLE              1
#define FM_MFT_FRT_TCSC1_AVAILABLE                1
#define FM0P_MFT_FRT_TCSC2_AVAILABLE              1
#define FM_MFT_FRT_TCSC2_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP0_AVAILABLE              1
#define FM_MFT_ICU_ICCP0_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP1_AVAILABLE              1
#define FM_MFT_ICU_ICCP1_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP2_AVAILABLE              1
#define FM_MFT_ICU_ICCP2_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP3_AVAILABLE              1
#define FM_MFT_ICU_ICCP3_AVAILABLE                1
#define FM0P_MFT_ICU_ICFS10_AVAILABLE             1
#define FM_MFT_ICU_ICFS10_AVAILABLE               1
#define FM0P_MFT_ICU_ICFS32_AVAILABLE             1
#define FM_MFT_ICU_ICFS32_AVAILABLE               1
#define FM0P_MFT_ICU_ICSA10_AVAILABLE             1
#define FM_MFT_ICU_ICSA10_AVAILABLE               1
#define FM0P_MFT_ICU_ICSA32_AVAILABLE             1
#define FM_MFT_ICU_ICSA32_AVAILABLE               1
#define FM0P_MFT_ICU_ICSB10_AVAILABLE             1
#define FM_MFT_ICU_ICSB10_AVAILABLE               1
#define FM0P_MFT_ICU_ICSB32_AVAILABLE             1
#define FM_MFT_ICU_ICSB32_AVAILABLE               1
#define FM0P_MFT_OCU_OCCP0_AVAILABLE              1
#define FM_MFT_OCU_OCCP0_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP1_AVAILABLE              1
#define FM_MFT_OCU_OCCP1_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP2_AVAILABLE              1
#define FM_MFT_OCU_OCCP2_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP3_AVAILABLE              1
#define FM_MFT_OCU_OCCP3_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP4_AVAILABLE              1
#define FM_MFT_OCU_OCCP4_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP5_AVAILABLE              1
#define FM_MFT_OCU_OCCP5_AVAILABLE                1
#define FM0P_MFT_OCU_OCFS10_AVAILABLE             1
#define FM_MFT_OCU_OCFS10_AVAILABLE               1
#define FM0P_MFT_OCU_OCFS32_AVAILABLE             1
#define FM_MFT_OCU_OCFS32_AVAILABLE               1
#define FM0P_MFT_OCU_OCFS54_AVAILABLE             1
#define FM_MFT_OCU_OCFS54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSA10_AVAILABLE             1
#define FM_MFT_OCU_OCSA10_AVAILABLE               1
#define FM0P_MFT_OCU_OCSA32_AVAILABLE             1
#define FM_MFT_OCU_OCSA32_AVAILABLE               1
#define FM0P_MFT_OCU_OCSA54_AVAILABLE             1
#define FM_MFT_OCU_OCSA54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSB10_AVAILABLE             1
#define FM_MFT_OCU_OCSB10_AVAILABLE               1
#define FM0P_MFT_OCU_OCSB32_AVAILABLE             1
#define FM_MFT_OCU_OCSB32_AVAILABLE               1
#define FM0P_MFT_OCU_OCSB54_AVAILABLE             1
#define FM_MFT_OCU_OCSB54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSC_AVAILABLE               1
#define FM_MFT_OCU_OCSC_AVAILABLE                 1
#define FM0P_MFT_OCU_OCSD10_AVAILABLE             1
#define FM_MFT_OCU_OCSD10_AVAILABLE               1
#define FM0P_MFT_OCU_OCSD32_AVAILABLE             1
#define FM_MFT_OCU_OCSD32_AVAILABLE               1
#define FM0P_MFT_OCU_OCSD54_AVAILABLE             1
#define FM_MFT_OCU_OCSD54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSE0_AVAILABLE              1
#define FM_MFT_OCU_OCSE0_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE1_AVAILABLE              1
#define FM_MFT_OCU_OCSE1_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE2_AVAILABLE              1
#define FM_MFT_OCU_OCSE2_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE3_AVAILABLE              1
#define FM_MFT_OCU_OCSE3_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE4_AVAILABLE              1
#define FM_MFT_OCU_OCSE4_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE5_AVAILABLE              1
#define FM_MFT_OCU_OCSE5_AVAILABLE                1
#define FM0P_MFT_WFG_NZCL_AVAILABLE               1
#define FM_MFT_WFG_NZCL_AVAILABLE                 1
#define FM0P_MFT_WFG_WFIR_AVAILABLE               1
#define FM_MFT_WFG_WFIR_AVAILABLE                 1
#define FM0P_MFT_WFG_WFSA10_AVAILABLE             1
#define FM_MFT_WFG_WFSA10_AVAILABLE               1
#define FM0P_MFT_WFG_WFSA32_AVAILABLE             1
#define FM_MFT_WFG_WFSA32_AVAILABLE               1
#define FM0P_MFT_WFG_WFSA54_AVAILABLE             1
#define FM_MFT_WFG_WFSA54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTA10_AVAILABLE             1
#define FM_MFT_WFG_WFTA10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTA32_AVAILABLE             1
#define FM_MFT_WFG_WFTA32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTA54_AVAILABLE             1
#define FM_MFT_WFG_WFTA54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTB10_AVAILABLE             1
#define FM_MFT_WFG_WFTB10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTB32_AVAILABLE             1
#define FM_MFT_WFG_WFTB32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTB54_AVAILABLE             1
#define FM_MFT_WFG_WFTB54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF10_AVAILABLE             1
#define FM_MFT_WFG_WFTF10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF32_AVAILABLE             1
#define FM_MFT_WFG_WFTF32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF54_AVAILABLE             1
#define FM_MFT_WFG_WFTF54_AVAILABLE               1
/*******************************************************************************
* MFT_PPG
*******************************************************************************/
#define FM0P_MFT_PPG_COMP0_AVAILABLE              1
#define FM_MFT_PPG_COMP0_AVAILABLE                1
#define FM0P_MFT_PPG_COMP1_AVAILABLE              1
#define FM_MFT_PPG_COMP1_AVAILABLE                1
#define FM0P_MFT_PPG_COMP10_AVAILABLE             1
#define FM_MFT_PPG_COMP10_AVAILABLE               1
#define FM0P_MFT_PPG_COMP12_AVAILABLE             1
#define FM_MFT_PPG_COMP12_AVAILABLE               1
#define FM0P_MFT_PPG_COMP14_AVAILABLE             1
#define FM_MFT_PPG_COMP14_AVAILABLE               1
#define FM0P_MFT_PPG_COMP2_AVAILABLE              1
#define FM_MFT_PPG_COMP2_AVAILABLE                1
#define FM0P_MFT_PPG_COMP3_AVAILABLE              1
#define FM_MFT_PPG_COMP3_AVAILABLE                1
#define FM0P_MFT_PPG_COMP4_AVAILABLE              1
#define FM_MFT_PPG_COMP4_AVAILABLE                1
#define FM0P_MFT_PPG_COMP5_AVAILABLE              1
#define FM_MFT_PPG_COMP5_AVAILABLE                1
#define FM0P_MFT_PPG_COMP6_AVAILABLE              1
#define FM_MFT_PPG_COMP6_AVAILABLE                1
#define FM0P_MFT_PPG_COMP7_AVAILABLE              1
#define FM_MFT_PPG_COMP7_AVAILABLE                1
#define FM0P_MFT_PPG_COMP8_AVAILABLE              1
#define FM_MFT_PPG_COMP8_AVAILABLE                1
#define FM0P_MFT_PPG_GATEC0_AVAILABLE             1
#define FM_MFT_PPG_GATEC0_AVAILABLE               1
#define FM0P_MFT_PPG_GATEC12_AVAILABLE            1
#define FM_MFT_PPG_GATEC12_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC16_AVAILABLE            1
#define FM_MFT_PPG_GATEC16_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC20_AVAILABLE            1
#define FM_MFT_PPG_GATEC20_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC4_AVAILABLE             1
#define FM_MFT_PPG_GATEC4_AVAILABLE               1
#define FM0P_MFT_PPG_GATEC8_AVAILABLE             1
#define FM_MFT_PPG_GATEC8_AVAILABLE               1
#define FM0P_MFT_PPG_IGBTC_AVAILABLE              1
#define FM_MFT_PPG_IGBTC_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC0_AVAILABLE              1
#define FM_MFT_PPG_PPGC0_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC1_AVAILABLE              1
#define FM_MFT_PPG_PPGC1_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC10_AVAILABLE             1
#define FM_MFT_PPG_PPGC10_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC11_AVAILABLE             1
#define FM_MFT_PPG_PPGC11_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC12_AVAILABLE             1
#define FM_MFT_PPG_PPGC12_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC13_AVAILABLE             1
#define FM_MFT_PPG_PPGC13_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC14_AVAILABLE             1
#define FM_MFT_PPG_PPGC14_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC15_AVAILABLE             1
#define FM_MFT_PPG_PPGC15_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC16_AVAILABLE             1
#define FM_MFT_PPG_PPGC16_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC17_AVAILABLE             1
#define FM_MFT_PPG_PPGC17_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC18_AVAILABLE             1
#define FM_MFT_PPG_PPGC18_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC19_AVAILABLE             1
#define FM_MFT_PPG_PPGC19_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC2_AVAILABLE              1
#define FM_MFT_PPG_PPGC2_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC20_AVAILABLE             1
#define FM_MFT_PPG_PPGC20_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC21_AVAILABLE             1
#define FM_MFT_PPG_PPGC21_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC22_AVAILABLE             1
#define FM_MFT_PPG_PPGC22_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC23_AVAILABLE             1
#define FM_MFT_PPG_PPGC23_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC3_AVAILABLE              1
#define FM_MFT_PPG_PPGC3_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC4_AVAILABLE              1
#define FM_MFT_PPG_PPGC4_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC5_AVAILABLE              1
#define FM_MFT_PPG_PPGC5_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC6_AVAILABLE              1
#define FM_MFT_PPG_PPGC6_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC7_AVAILABLE              1
#define FM_MFT_PPG_PPGC7_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC8_AVAILABLE              1
#define FM_MFT_PPG_PPGC8_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC9_AVAILABLE              1
#define FM_MFT_PPG_PPGC9_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH0_AVAILABLE              1
#define FM_MFT_PPG_PRLH0_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH1_AVAILABLE              1
#define FM_MFT_PPG_PRLH1_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH10_AVAILABLE             1
#define FM_MFT_PPG_PRLH10_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH11_AVAILABLE             1
#define FM_MFT_PPG_PRLH11_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH12_AVAILABLE             1
#define FM_MFT_PPG_PRLH12_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH13_AVAILABLE             1
#define FM_MFT_PPG_PRLH13_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH14_AVAILABLE             1
#define FM_MFT_PPG_PRLH14_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH15_AVAILABLE             1
#define FM_MFT_PPG_PRLH15_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH16_AVAILABLE             1
#define FM_MFT_PPG_PRLH16_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH17_AVAILABLE             1
#define FM_MFT_PPG_PRLH17_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH18_AVAILABLE             1
#define FM_MFT_PPG_PRLH18_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH19_AVAILABLE             1
#define FM_MFT_PPG_PRLH19_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH2_AVAILABLE              1
#define FM_MFT_PPG_PRLH2_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH20_AVAILABLE             1
#define FM_MFT_PPG_PRLH20_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH21_AVAILABLE             1
#define FM_MFT_PPG_PRLH21_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH22_AVAILABLE             1
#define FM_MFT_PPG_PRLH22_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH23_AVAILABLE             1
#define FM_MFT_PPG_PRLH23_AVAILABLE               1
#define FM0P_MFT_PPG_PRLH3_AVAILABLE              1
#define FM_MFT_PPG_PRLH3_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH4_AVAILABLE              1
#define FM_MFT_PPG_PRLH4_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH5_AVAILABLE              1
#define FM_MFT_PPG_PRLH5_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH6_AVAILABLE              1
#define FM_MFT_PPG_PRLH6_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH7_AVAILABLE              1
#define FM_MFT_PPG_PRLH7_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH8_AVAILABLE              1
#define FM_MFT_PPG_PRLH8_AVAILABLE                1
#define FM0P_MFT_PPG_PRLH9_AVAILABLE              1
#define FM_MFT_PPG_PRLH9_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL0_AVAILABLE              1
#define FM_MFT_PPG_PRLL0_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL1_AVAILABLE              1
#define FM_MFT_PPG_PRLL1_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL10_AVAILABLE             1
#define FM_MFT_PPG_PRLL10_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL11_AVAILABLE             1
#define FM_MFT_PPG_PRLL11_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL12_AVAILABLE             1
#define FM_MFT_PPG_PRLL12_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL13_AVAILABLE             1
#define FM_MFT_PPG_PRLL13_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL14_AVAILABLE             1
#define FM_MFT_PPG_PRLL14_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL15_AVAILABLE             1
#define FM_MFT_PPG_PRLL15_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL16_AVAILABLE             1
#define FM_MFT_PPG_PRLL16_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL17_AVAILABLE             1
#define FM_MFT_PPG_PRLL17_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL18_AVAILABLE             1
#define FM_MFT_PPG_PRLL18_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL19_AVAILABLE             1
#define FM_MFT_PPG_PRLL19_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL2_AVAILABLE              1
#define FM_MFT_PPG_PRLL2_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL20_AVAILABLE             1
#define FM_MFT_PPG_PRLL20_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL21_AVAILABLE             1
#define FM_MFT_PPG_PRLL21_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL22_AVAILABLE             1
#define FM_MFT_PPG_PRLL22_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL23_AVAILABLE             1
#define FM_MFT_PPG_PRLL23_AVAILABLE               1
#define FM0P_MFT_PPG_PRLL3_AVAILABLE              1
#define FM_MFT_PPG_PRLL3_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL4_AVAILABLE              1
#define FM_MFT_PPG_PRLL4_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL5_AVAILABLE              1
#define FM_MFT_PPG_PRLL5_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL6_AVAILABLE              1
#define FM_MFT_PPG_PRLL6_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL7_AVAILABLE              1
#define FM_MFT_PPG_PRLL7_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL8_AVAILABLE              1
#define FM_MFT_PPG_PRLL8_AVAILABLE                1
#define FM0P_MFT_PPG_PRLL9_AVAILABLE              1
#define FM_MFT_PPG_PRLL9_AVAILABLE                1
#define FM0P_MFT_PPG_REVC0_AVAILABLE              1
#define FM_MFT_PPG_REVC0_AVAILABLE                1
#define FM0P_MFT_PPG_REVC1_AVAILABLE              1
#define FM_MFT_PPG_REVC1_AVAILABLE                1
#define FM0P_MFT_PPG_TRG0_AVAILABLE               1
#define FM_MFT_PPG_TRG0_AVAILABLE                 1
#define FM0P_MFT_PPG_TRG1_AVAILABLE               1
#define FM_MFT_PPG_TRG1_AVAILABLE                 1
#define FM0P_MFT_PPG_TTCR0_AVAILABLE              1
#define FM_MFT_PPG_TTCR0_AVAILABLE                1
#define FM0P_MFT_PPG_TTCR1_AVAILABLE              1
#define FM_MFT_PPG_TTCR1_AVAILABLE                1
#define FM0P_MFT_PPG_TTCR2_AVAILABLE              1
#define FM_MFT_PPG_TTCR2_AVAILABLE                1
/*******************************************************************************
* MTB_DWT
*******************************************************************************/
#define FM0P_MTB_DWT_CID0_AVAILABLE               1
#define FM_MTB_DWT_CID0_AVAILABLE                 1
#define FM0P_MTB_DWT_CID1_AVAILABLE               1
#define FM_MTB_DWT_CID1_AVAILABLE                 1
#define FM0P_MTB_DWT_CID2_AVAILABLE               1
#define FM_MTB_DWT_CID2_AVAILABLE                 1
#define FM0P_MTB_DWT_CID3_AVAILABLE               1
#define FM_MTB_DWT_CID3_AVAILABLE                 1
#define FM0P_MTB_DWT_CMP_ADDR_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_ADDR_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_ADDR_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_ADDR_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_CMP_DATA_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_DATA_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_DATA_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_DATA_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_CMP_MASK_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_MASK_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_MASK_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_MASK_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_FCT_AVAILABLE                1
#define FM_MTB_DWT_FCT_AVAILABLE                  1
#define FM0P_MTB_DWT_PID0_AVAILABLE               1
#define FM_MTB_DWT_PID0_AVAILABLE                 1
#define FM0P_MTB_DWT_PID1_AVAILABLE               1
#define FM_MTB_DWT_PID1_AVAILABLE                 1
#define FM0P_MTB_DWT_PID2_AVAILABLE               1
#define FM_MTB_DWT_PID2_AVAILABLE                 1
#define FM0P_MTB_DWT_PID3_AVAILABLE               1
#define FM_MTB_DWT_PID3_AVAILABLE                 1
#define FM0P_MTB_DWT_PID4_AVAILABLE               1
#define FM_MTB_DWT_PID4_AVAILABLE                 1
#define FM0P_MTB_DWT_PID5_AVAILABLE               1
#define FM_MTB_DWT_PID5_AVAILABLE                 1
#define FM0P_MTB_DWT_PID6_AVAILABLE               1
#define FM_MTB_DWT_PID6_AVAILABLE                 1
#define FM0P_MTB_DWT_PID7_AVAILABLE               1
#define FM_MTB_DWT_PID7_AVAILABLE                 1
/*******************************************************************************
* QPRC0
*******************************************************************************/
#define FM0P_QPRC_QCR_AVAILABLE                   1
#define FM_QPRC_QCR_AVAILABLE                     1
#define FM0P_QPRC_QECR_AVAILABLE                  1
#define FM_QPRC_QECR_AVAILABLE                    1
#define FM0P_QPRC_QICRH_AVAILABLE                 1
